In [1]:
import sqlite3

In [2]:
con = sqlite3.connect("DSdatabase.db")

In [3]:
cursor = con.cursor()

In [4]:
cursor.execute("CREATE TABLE colleagues(id integer PRIMARY KEY, name text, salary real, department text, position text, hiredate text)")
con.commit()

In [5]:
cursor.execute("INSERT INTO colleagues VALUES(1, 'Chinenye Vivian', 1000, 'DS Rep', 'second', '6-06-2019')")
con.commit()

In [7]:
entities = (2, 'Kate O', 1200, 'DS', 'first', '20-04-2021')
cursor.execute("INSERT INTO colleagues(id,name,salary,department,position,hiredate) VALUES(?,?,?,?,?,?)",entities)
con.commit()

In [8]:
id = int(input("Enter your id: "))
name = input("Enter your name: ")
salary = float(input("Enter your salary: "))
department = input("Enter your department: ")
position = input("Enter your position: ")
hiredate = input("Enter your hiredate: ")
entities = (id,name,salary,department,position,hiredate)

cursor.execute("INSERT INTO colleagues(id,name,salary,department,position,hiredate) VALUES(?,?,?,?,?,?)",entities)
con.commit()

Enter your id: 3
Enter your name: Emeto Winner
Enter your salary: 1500
Enter your department: DS Facilitator
Enter your position: CEO
Enter your hiredate: 11-01-2021

In [9]:
id = int(input("Enter your id: "))
name = input("Enter your name: ")
salary = float(input("Enter your salary: "))
department = input("Enter your department: ")
position = input("Enter your position: ")
hiredate = input("Enter your hiredate: ")
entities = (id,name,salary,department,position,hiredate)

cursor.execute("INSERT INTO colleagues(id,name,salary,department,position,hiredate) VALUES(?,?,?,?,?,?)",entities)
con.commit()

Enter your hiredate: 04-02-2021

In [11]:
cursor.execute("UPDATE colleagues SET hiredate = '20-04-2021' WHERE id = 4")
con.commit()

In [12]:
cursor.execute("SELECT * FROM colleagues")
rows = cursor.fetchall()

for row in rows:
  print(row)

(1, 'Chinenye Vivian', 1000.0, 'DS Rep', 'second', '6-06-2019')
(2, 'Kate O', 1200.0, 'DS', 'first', '20-04-2021')
(3, 'Emeto Winner', 1500.0, 'DS Facilitator', 'CEO', '11-01-2021')
(4, 'Lilian U', 1000.0, 'DS', 'DS student', '20-04-2021')

In [13]:
cursor.execute("UPDATE colleagues SET position = 'third' WHERE id = 4")
con.commit()

In [15]:
cursor.execute("SELECT name,position FROM colleagues")
namep = cursor.fetchall()

for name in namep:
  print(name)

('Chinenye Vivian', 'second')
('Kate O', 'first')
('Emeto Winner', 'CEO')
('Lilian U', 'third')

In [16]:
cursor.execute("SELECT name,salary,position,hiredate FROM colleagues ORDER BY hiredate")
descriptions = cursor.fetchall()

for desc in descriptions:
  print(desc)

('Emeto Winner', 1500.0, 'CEO', '11-01-2021')
('Kate O', 1200.0, 'first', '20-04-2021')
('Lilian U', 1000.0, 'third', '20-04-2021')
('Chinenye Vivian', 1000.0, 'second', '6-06-2019')

## To Populate My Database Automatically

In [18]:
counter = True
while counter:
    id = int(input("Enter your id: "))
    name = input("Enter your name: ")
    salary = float(input("Enter your salary: "))
    department = input("Enter your department: ")
    position = input("Enter your position: ")
    hiredate = input("Enter your hiredate: ")
    entities = (id,name,salary,department,position,hiredate)
    cursor.execute("INSERT INTO colleagues(id,name,salary,department,position,hireDate) VALUES(?,?,?,?,?,?)",entities)
    con.commit()
    print('Data has been inserted!!!')
    print('Do you want to continue?')
    value = int(input("Enter 1 to continue and 0 to quit"))
    if value == 1:
        pass
    elif value == 0:
        print('Thank you!!')
        counter = False
    else:
        break

Enter your id: 9
Enter your name: Habiba Sa
Enter your salary: 1000
Enter your department: DS
Enter your position: nineth
Enter your hiredate: 23-04-2021
Data has been inserted!!!
Do you want to continue?
Enter 1 to continue and 0 to quit0
Thank you!!

In [22]:
cursor.execute("SELECT * FROM colleagues")
data = cursor.fetchall()

for d in data:
  print(d)

(1, 'Chinenye Vivian', 1000.0, 'DS Rep', 'second', '6-06-2019')
(2, 'Kate O', 1200.0, 'DS', 'first', '20-04-2021')
(3, 'Emeto Winner', 1500.0, 'DS Facilitator', 'CEO', '11-01-2021')
(4, 'Lilian U', 1000.0, 'DS', 'third', '20-04-2021')
(5, 'Mercy Ak', 1000.0, 'DS', 'sixth', '21-04-2021')
(6, 'Mercy Sa', 1000.0, 'DS', 'seventh ', '21-04-2021')
(7, 'Chege Jacinta', 1000.0, 'DS', 'eight', '22-04-2021')
(9, 'Habiba Sa', 1000.0, 'DS', 'nineth', '23-04-2021')

In [23]:
newlist = []

In [24]:
for d in data:
    newlist.append({'id':d[0], 'name':d[1], 'salary':d[2], 'department':d[3], 'position':d[4], 'hiredate':d[5]})

In [26]:
import pandas as pd


df = pd.DataFrame(newlist)
df.head()

   id             name  salary      department position    hiredate
0   1  Chinenye Vivian  1000.0          DS Rep   second   6-06-2019
1   2           Kate O  1200.0              DS    first  20-04-2021
2   3     Emeto Winner  1500.0  DS Facilitator      CEO  11-01-2021
3   4         Lilian U  1000.0              DS    third  20-04-2021
4   5         Mercy Ak  1000.0              DS    sixth  21-04-2021

In [27]:
df.dtypes

id              int64
name           object
salary        float64
department     object
position       object
hiredate       object
dtype: object

In [28]:
df.shape

(8, 6)